Repository: CofficLab/Lumi
Catalog: Plugins/ProjectIssueScannerPlugin/Sources/Localizable.xcstrings
Source language: en
Languages: zh_hans, zh_hk

source: A catch block swallows errors without handling or logging them.
zh_hans: catch 块吞没了错误而没有处理或记录它们。
zh_hk: catch 塊吞沒了錯誤而沒有處理或記錄它們。

source: Click Scan Now to check for potential issues.
zh_hans: 点击「立即扫描」检查潜在问题。
zh_hk: 點擊「立即掃描」檢查潛在問題。

source: Idle
zh_hans: 空闲
zh_hk: 閒置

source: No issues found
zh_hans: 未发现问题
zh_hk: 未發現問題

source: Project Issue Scanner
zh_hans: 项目问题扫描
zh_hk: 專案問題掃描

source: Project Issues
zh_hans: 项目问题
zh_hk: 專案問題

source: Ready
zh_hans: 就绪
zh_hk: 就緒

source: Scan Now
zh_hans: 立即扫描
zh_hk: 立即掃描

source: Scanning
zh_hans: 扫描中
zh_hk: 掃描中

source: Scanning project issues...
zh_hans: 正在扫描项目问题…
zh_hk: 正在掃描專案問題…

source: Scans for project issues during idle time and hints them to the LLM.
zh_hans: 在空闲时扫描项目中的潜在问题，并在对话时提示给 LLM。
zh_hk: 在閒置時掃描專案中的潛在問題，並在對話時提示給 LLM。

# 供应商
source: Provider
zh_hans: 供应商
zh_hk: 供應商

source: Configure scan sensitivity in plugin settings
zh_hans: 在插件设置中配置扫描灵敏度
zh_hk: 在外掛設定中設定掃描靈敏度

source: Provides contextual hints to the LLM about known issues
zh_hans: 向 LLM 提供已知问题的上下文提示
zh_hk: 向 LLM 提供已知問題的上下文提示

source: Maintains a list of detected issues for reference
zh_hans: 维护已检测问题列表供参考
zh_hk: 維護已偵測問題列表供參考

source: AI-Powered Hints
zh_hans: AI 智能提示
zh_hk: AI 智能提示

source: Background Processing
zh_hans: 后台处理
zh_hk: 背景處理

source: Runs scans in the background without disrupting your workflow
zh_hans: 在后台运行扫描，不干扰你的工作流
zh_hk: 在背景執行掃描，不干擾你的工作流程

source: Analyzes project files for common issues
zh_hans: 分析项目文件中的常见问题
zh_hk: 分析專案檔案中的常見問題

source: Idle-Time Scanning
zh_hans: 空闲时扫描
zh_hk: 閒置時掃描

source: Monitors system idle time to trigger scans
zh_hans: 监控系统空闲时间以触发扫描
zh_hk: 監控系統閒置時間以觸發掃描

source: Stores detected issues in a local database
zh_hans: 将检测到的问题存储在本地数据库
zh_hk: 將偵測到的問題儲存在本機資料庫

source: Issue Tracking
zh_hans: 问题跟踪
zh_hk: 問題追蹤

source: Provides hints to LLM during chat sessions
zh_hans: 在聊天会话期间向 LLM 提供提示
zh_hk: 在聊天工作階段期間向 LLM 提供提示

source: Enable during development for proactive issue detection
zh_hans: 开发期间启用以主动检测问题
zh_hk: 開發期間啟用以主動偵測問題

source: Review detected issues regularly
zh_hans: 定期查看检测到的问题
zh_hk: 定期查看偵測到的問題

source: Automatically scans for project issues when the system is idle
zh_hans: 在系统空闲时自动扫描项目问题
zh_hk: 在系統閒置時自動掃描專案問題
